eisup_2019_docmng_integration/src/Documents/абс_РаспознованиеПлатежейПокупателей/абс_РаспознованиеПлатежейПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РаспознованиеПлатежейПокупателей</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перепроводить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОплаты</name>
      <type>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗачетАванса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОплаты</name>
      <type>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетОплаты</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Счета</name>
    <attributes>
      <name>СчетОплаты</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БанковскиеСчета</name>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/ВидыОперацийПоступлениеБезналичныхДенежныхСредств/ВидыОперацийПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеБезналичныхДенежныхСредств</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПокупателя</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитамИЗаймам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчетыСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеБезналичныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеИностраннойВалюты</name>
  </enumValues>
  <enumValues>
    <name>ПоступленияОтПродажиИностраннойВалюты</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоПлатежнымКартам</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоБанковскимКредитам</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ДокументРасчетовСКонтрагентом/ДокументРасчетовСКонтрагентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументРасчетовСКонтрагентом</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахНалоговыйУчет</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ВводНачальныхОстатковНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_СФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_Дата</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_Номер</name>
    <comment>(Общ) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ВнешняяКорректировкаЗапрещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_НомерСФ</name>
    <comment>(Общ) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ДатаСФ</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

eisup_2019_docmng_integration/src/Documents/абс_РаспознованиеПлатежейПокупателей/ObjectModule.bsl
Процедура ВыполнитьСопоставление() Экспорт
	Кол = Оплаты.Количество();
	Сч = 0;
	Для Каждого СтрокаОплат Из Оплаты Цикл
		//ОбработкаПрерыванияПользователя();
		Сч = Сч+1;
		//состояние("Обрабатывается "+Сч+" из "+Кол);
		Если Не ЗначениеЗаполнено(СтрокаОплат.Накладная) Тогда
			МассивСлов =  РазобратьСтрокуНазначения(СтрокаОплат.НазначениеПлатежа).МассивСлов;
			НомерСчета = "";
			Если МассивСлов<>Неопределено Тогда
				
				Если Не ЗначениеЗаполнено(НомерСчета) Тогда
					Для Каждого Эл Из МассивСлов Цикл
						СтрокаСчета = СокрЛП(Эл);
						Если Не ЗначениеЗаполнено(НомерСчета) Тогда
							
							Если СтрДлина(СтрокаСчета)=12 Тогда
								Если ЕстьЧисло(Прав(СтрокаСчета,1)) И
									ЕстьЧисло(Сред(СтрокаСчета,11,1)) И
									ЕстьЧисло(Сред(СтрокаСчета,10,1)) И
									ЕстьЧисло(Сред(СтрокаСчета,9,1)) И
									ЕстьЧисло(Сред(СтрокаСчета,8,1)) И
									ЕстьЧисло(Сред(СтрокаСчета,7,1))  Тогда  
									НомерСчета = СтрокаСчета;
								КонецЕсли;
							ИначеЕсли СтрДлина(СтрокаСчета)=13 Тогда
								Если СтрДлина(СтрокаСчета)=13 Тогда
									Если ЕстьЧисло(Сред(СтрокаСчета,13,1)) И
										ЕстьЧисло(Сред(СтрокаСчета,12,1)) И
										ЕстьЧисло(Сред(СтрокаСчета,11,1)) И
										ЕстьЧисло(Сред(СтрокаСчета,10,1)) И
										ЕстьЧисло(Сред(СтрокаСчета,9,1)) И
										ЕстьЧисло(Сред(СтрокаСчета,8,1))  Тогда  
										НомерСчета = СтрокаСчета;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;
				КонецЕсли; 
				Если ЗначениеЗаполнено(НомерСчета) Тогда
					Накладная = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(СокрЛП(НомерСчета),ДатаНач);
					Если Накладная.Пустая() Тогда
						Накладная = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(СокрЛП(НомерСчета),ДатаКон);
					КонецЕсли;
					Если Накладная.Пустая() Тогда
						Если  СтрДлина(НомерСчета)=13 И Лев(НомерСчета,1) ="N" Тогда
							Накладная = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(СокрЛП(Прав(НомерСчета,12)),'20110101');
						КонецЕсли;
					КонецЕсли;

					
					Если Накладная.Пустая() Тогда
						Накладная = Документы.ДокументРасчетовСКонтрагентом.НайтиПоНомеру(СокрЛП(НомерСчета),'20100101');
					КонецЕсли;
					
					Если Накладная.Пустая() Тогда
						Если  СтрДлина(НомерСчета)=13 И Лев(НомерСчета,1) ="N" Тогда
							Накладная = Документы.ДокументРасчетовСКонтрагентом.НайтиПоНомеру(СокрЛП(Прав(НомерСчета,12)),'20100101');
						КонецЕсли;	
					КонецЕсли;

					
					Если ЗначениеЗаполнено(Накладная) Тогда
						СтрокаОплат.Накладная = Накладная;
						ОбОплата = СтрокаОплат.ДокументОплаты.ПолучитьОбъект();
						Для каждого Стр Из ОбОплата.РасшифровкаПлатежа Цикл
							Стр.ДокументРасчетовСКонтрагентом = Накладная;
						КонецЦикла;
						ОбОплата.Записать();
					КонецЕсли;
					
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Процедура разбора строки на слова и 
// поиск по вариантам поиска
//Возвращает Номер договора и Номер счета
Функция РазобратьСтрокуНазначения(НазначениеПлатежаПолное)
	
	//Убираем сумму из назначения
	НазначениеПлатежа = НазначениеПлатежаПолное;
	СимволСуммы = Найти(НазначениеПлатежаПолное,"Сумма");
	
	
	Если СимволСуммы>0 Тогда
		НазначениеПлатежа = Лев(НазначениеПлатежа,СимволСуммы);
		
	КонецЕсли;
	
	СимволНДС = Найти(НазначениеПлатежа,"НДС");
	Если СимволНДС>0 Тогда
		НазначениеПлатежа = Лев(НазначениеПлатежа,СимволНДС);
		
	КонецЕсли;
	//\\
	
	СтруктураВозврата = Новый Структура("НомерДоговора,НомерСчета,МассивСлов");
	СтруктураВозврата.НомерДоговора = "";
	СтруктураВозврата.НомерСчета = "";
	СтруктураВозврата.МассивСлов = Новый Массив;
	
	ТаблицаВариантов = Новый ТаблицаЗначений;
	ТаблицаВариантов.Колонки.Добавить("НомерДоговора");
	ТаблицаВариантов.Колонки.Добавить("НомерСчета");
	
	НоваяСтрока = ТаблицаВариантов.Добавить();
	НоваяСтрока.НомерДоговора = "дог";
	НоваяСтрока.НомерСчета = "сч";
	
	НоваяСтрока = ТаблицаВариантов.Добавить();
	НоваяСтрока.НомерДоговора = "№";
	НоваяСтрока.НомерСчета = "cч";
	
	
	
	НоваяСтрока = ТаблицаВариантов.Добавить();
	НоваяСтрока.НомерДоговора = "Договору";
	НоваяСтрока.НомерСчета = "по счету";
	
	
	
	НоваяСтрока = ТаблицаВариантов.Добавить();
	НоваяСтрока.НомерДоговора = " дог.";
	НоваяСтрока.НомерСчета = " сч";
	
	НоваяСтрока = ТаблицаВариантов.Добавить();
	НоваяСтрока.НомерДоговора = "Договор";
	НоваяСтрока.НомерСчета = "Счет";
	
	НоваяСтрока = ТаблицаВариантов.Добавить();
	НоваяСтрока.НомерДоговора = "ДОГОВОР";
	НоваяСтрока.НомерСчета = "СЧЕТ";
	
	
	
	
	//Разбор строки на массив слов
	МассивСлов = Новый Массив;
	ТекСтрокаРазбора  = НазначениеПлатежа;
	ПозицияПробела = Найти(ТекСтрокаРазбора," ");
	Пока ПозицияПробела>0 Цикл
		МассивСлов.Добавить(Лев(ТекСтрокаРазбора,ПозицияПробела-1));
		ТекСтрокаРазбора = Сред(ТекСтрокаРазбора,ПозицияПробела+1);
		ПозицияПробела =Найти(ТекСтрокаРазбора," ");
		Если ПозицияПробела = 0 Тогда
			Прервать;
		КонецЕсли;
		//ОбработкаПрерыванияПользователя();	
	КонецЦикла;
	
	//Удаляем из массива лишние элементы и символы
	КолЭлем = МассивСлов.Количество();
	Сч =0;
	Для Сч =0 По КолЭлем-1 Цикл
		Если МассивСлов[КолЭлем-1-Сч]="№" 
			или МассивСлов[КолЭлем-1-Сч] = "N" ИЛИ   МассивСлов[КолЭлем-1-Сч] = " " Тогда
			МассивСлов.Удалить(КолЭлем-1-Сч); 
		КонецЕсли; 
	КонецЦикла;
	
	
	
	//Удаляем из массива лишние элементы и символы 
	й =0;
	Кол = МАссивСлов.Количество();
	Для Каждого Слово Из МассивСлов Цикл
		й =й+1;
		Если ЗначениеЗаполнено(СтруктураВозврата.НомерСчета) И ЗначениеЗаполнено(СтруктураВозврата.НомерДоговора) Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого ВариантПоиска Из ТаблицаВариантов Цикл
			ПозицияДог = Найти(Слово,ВариантПоиска.НомерДоговора);
			ПозицияСч  = Найти(Слово,ВариантПоиска.НомерСчета);
			
			Если ПозицияДог>0 и й<Кол Тогда
				Если Не ЗначениеЗаполнено(СтруктураВозврата.НомерДоговора) Тогда
					СтруктураВозврата.НомерДоговора = УбратьЛишниеСимволы(МАссивСлов[й]); 
				КонецЕсли; 
			КонецЕсли;
			
			Если ПозицияСч>0 и й<Кол Тогда
				Если Не ЗначениеЗаполнено(СтруктураВозврата.НомерСчета) Тогда
					СимволЧисла = ЕстьЧисло((МАссивСлов[й-1]));
					Если  СимволЧисла>0 Тогда
						
						СтруктураВозврата.НомерСчета= Сред(УбратьЛишниеСимволы(МАссивСлов[й-1]),СимволЧисла);						 
					Иначе
						СтруктураВозврата.НомерСчета = УбратьЛишниеСимволы(МАссивСлов[й]); 	 
					КонецЕсли;	 
					
				КонецЕсли; 
			КонецЕсли;
			
		КонецЦикла; 
	КонецЦикла;
	
	СтруктураВозврата.МассивСлов = МассивСлов;
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ЕстьЧисло(Текст)
	
	МассивЦифр = Новый Массив;
	МассивЦифр.Добавить("1");
	МассивЦифр.Добавить("2");
	МассивЦифр.Добавить("3");
	МассивЦифр.Добавить("4");
	МассивЦифр.Добавить("5");
	МассивЦифр.Добавить("6");
	МассивЦифр.Добавить("7");
	МассивЦифр.Добавить("8");
	МассивЦифр.Добавить("9");
	МассивЦифр.Добавить("0");
	
	Для Каждого Элемент Из МассивЦифр Цикл
		Если Найти(Текст,Элемент)>0 Тогда
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

Функция УбратьЛишниеСимволы(СтрокаРезультата)
	
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата,"№","");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата,"!","");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата,"от","");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата,".","");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата,",","");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата,"-","");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата,")","");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата,"(","");
	
	
	Если Лев(СтрокаРезультата,1)="N" Тогда
		СтрокаРезультата = Сред(СтрокаРезультата,2);
	КонецЕсли;	
	Возврат СтрокаРезультата;
КонецФункции

Процедура ЗаполнитьРасчетныйДокументВПлатеже(ТекущаяСтрокаОплаты,ТекущаяСтрокаНакладных,Источник,Приемник,Сумма)Экспорт
	
	Объект = Источник.ПолучитьОбъект();
	Для каждого Стр Из Объект.РасшифровкаПлатежа Цикл
		Если Не ЗначениеЗаполнено(Стр.ДокументРасчетовСКонтрагентом) Тогда
			Если Стр.СуммаВзаиморасчетов <= Сумма Тогда
				Стр.ДокументРасчетовСКонтрагентом = Приемник;
				ТекущаяСтрокаОплаты.Накладная = ТекущаяСтрокаНакладных.Накладная;
			Иначе
				
				ТекСтрока = Стр;
				СуммаВзаиморасчетов = ТекСтрока.СуммаВзаиморасчетов;
				Если СуммаВзаиморасчетов>Сумма  Тогда
					
					ТекущаяСтрокаОплаты.Накладная = ТекущаяСтрокаНакладных.Накладная;
					
					СтрокаРасшифровки = Объект.РасшифровкаПлатежа.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаРасшифровки,ТекСтрока);
					СтрокаРасшифровки.СуммаВзаиморасчетов = Сумма;
					СтрокаРасшифровки.ДокументРасчетовСКонтрагентом = Приемник;
					ТекСтрока.СуммаВзаиморасчетов = ТекСтрока.СуммаВзаиморасчетов-Сумма;
					
					//Пересчет сумм в строке СтрокаРасшифровки
					ДоговорСтрокаПлатеж = СтрокаРасшифровки.ДоговорКонтрагента;
					Если НЕ ДоговорСтрокаПлатеж.РасчетыВУсловныхЕдиницах
						И ДоговорСтрокаПлатеж.ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
						
						СтрокаРасшифровки.СуммаПлатежа = СтрокаРасшифровки.СуммаВзаиморасчетов;
						УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаРасшифровки);
					КонецЕсли;
					
					
					Если СтрокаРасшифровки.КурсВзаиморасчетовПлан>0 Тогда
						РассчитатьСуммуПлатежаПлан(Объект,СтрокаРасшифровки);
					КонецЕсли;
					
					//Пересчет сумм в строке СтрокаРасшифровки
					
					//Пересчет сумм в строке текстрока
					ДоговорСтрокаПлатеж = ТекСтрока.ДоговорКонтрагента;
					Если НЕ ДоговорСтрокаПлатеж.РасчетыВУсловныхЕдиницах
						И ДоговорСтрокаПлатеж.ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
						
						ТекСтрока.СуммаПлатежа = ТекСтрока.СуммаВзаиморасчетов;
						УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(ТекСтрока);
					КонецЕсли;
					
					
					Если ТекСтрока.КурсВзаиморасчетовПлан>0 Тогда
						РассчитатьСуммуПлатежаПлан(Объект,ТекСтрока);
					КонецЕсли;
					
					//Пересчет сумм в строке текстрока
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Попытка
		Если Перепроводить Тогда
			
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Объект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	Исключение
		Объект.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;

	
КонецПроцедуры

Процедура РассчитатьСуммуПлатежаПлан(Объект,СтрокаПлатеж)
	
	Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.ДокументПланированияПлатежа) Тогда
		Возврат;
	КонецЕсли;
	
	//ПроверкаКурсовВалют();
	ЕстьРасчетыСКонтрагентами=УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(Объект.ВидОперации);

	Если ЕстьРасчетыСКонтрагентами ИЛИ Объект.ВидОперации=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам Тогда
		ВалютаВзаиморасчетов= СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	Иначе
		СтрокаПлатеж.СуммаПлатежаПлан=СтрокаПлатеж.СуммаВзаиморасчетов;
		Возврат;
	КонецЕсли;
	
	Если ВалютаВзаиморасчетов=Объект.ВалютаДокумента Тогда
		СтрокаПлатеж.СуммаПлатежаПлан=СтрокаПлатеж.СуммаВзаиморасчетов;
	
	ИначеЕсли (Объект.КурсДокумента <> 0) И (СтрокаПлатеж.КратностьВзаиморасчетов <> 0) И (СтрокаПлатеж.КурсВзаиморасчетовПлан <> 0) Тогда
		СтрокаПлатеж.СуммаПлатежаПлан=МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, ВалютаВзаиморасчетов,
															Объект.ВалютаДокумента,
			                                                СтрокаПлатеж.КурсВзаиморасчетовПлан,Объект.КурсДокумента,
															СтрокаПлатеж.КратностьВзаиморасчетов,Объект.КратностьДокумента);	
	Иначе
		СтрокаПлатеж.СуммаПлатежаПлан = 0;
	КонецЕсли;

КонецПроцедуры // РассчитатьСуммуПлатежаПлан()

Процедура ОчиститьРасчетныйДокументВПлатеже(ДокументОплаты,Накладная) Экспорт
	
	Док = ДокументОплаты.ПолучитьОбъект();
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("ДокументРасчетовСКонтрагентом",Накладная);
	МассивСтрок = Док.РасшифровкаПлатежа.НайтиСтроки(СтруктураОтбора);
	Если МассивСтрок<>Неопределено Тогда
		Для Каждого СтрокаРасшифровки Из МассивСтрок Цикл
		СтрокаРасшифровки.ДокументРасчетовСКонтрагентом = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;

	Док.РасшифровкаПлатежа.Свернуть("ДоговорКонтрагента,Сделка,КурсВзаиморасчетов,КратностьВзаиморасчетов,
		 |СтавкаНДС,СтатьяДвиженияДенежныхСредств,СчетУчетаРасчетовСКонтрагентом,СчетУчетаРасчетовПоАвансам,
		 |ДокументПланированияПлатежа,Проект,КурсВзаиморасчетовПлан,ДокументРасчетовСКонтрагентом","СуммаПлатежа,СуммаВзаиморасчетов,СуммаНДС,СуммаПлатежаПлан");
	Попытка
		Если Перепроводить Тогда
			Док.Записать(РежимЗаписиДокумента.Проведение);	
		Иначе
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	Исключение
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;

	
КонецПроцедуры


Процедура ЗаполнитьРасчетныйДокументВНакладной(Источник,Приемник) Экспорт
	
	Объект = Источник.ПолучитьОбъект();
	Если Объект.ДокументыРасчетовСКонтрагентом.Найти(Приемник,"ДокументРасчетовСКонтрагентом")=Неопределено Тогда
		НоваяСтрока = Объект.ДокументыРасчетовСКонтрагентом.Добавить();
		НоваяСтрока.ДокументРасчетовСКонтрагентом =  Приемник;
		НоваяСтрока.ДатаОплаты =  Приемник.Дата;
		НоваяСтрока.СуммаРегл =  Приемник.СуммаДокумента;
		НоваяСтрока.СуммаВзаиморасчетов =  Приемник.СуммаДокумента;	
	КонецЕсли;
	Объект.Записать();
	
КонецПроцедуры

Процедура УдалитьРасчетныйДокументВНакладной(Источник,Приемник) Экспорт
	Объект = Источник.ПолучитьОбъект();
	СтрокаРасчетногоДокумента = Объект.ДокументыРасчетовСКонтрагентом.Найти(Приемник,"ДокументРасчетовСКонтрагентом");
	Если СтрокаРасчетногоДокумента<>Неопределено Тогда
		Объект.ДокументыРасчетовСКонтрагентом.Удалить(СтрокаРасчетногоДокумента);
	КонецЕсли;
	Объект.Записать();
КонецПроцедуры
